#! /data/sever/python/bin/python
# -*- coding:utf-8 -*-
"""
@file: settings.py
@date: 2016-10-21
"""
__author__ = 'root'

import logging

logging.basicConfig(
    level=logging.INFO,
    format='[%(levelname)s %(asctime)s %(filename)s:%(lineno)d] %(message)s',
    datefmt='%Y%m%d %H:%M:%S'
)

MAIL_CONF = {
    "server": "smtp.sina.com",
    "user": "xyznoogel@sina.com",
    "pass": "xyznoogel123"
}

SEND_MAIL = ["noogel@163.com"]

TYPE_MAP = {
    "男装": [
        "皮裤男", "新款男", "男女羽绒裤", "男士", "小脚裤男", ["裤", "男"], ["男", "裤"],
        "牛仔裤男", "青年男", "夹克男", "男外套", "卫衣男", "运动裤男", "马甲男", "男装",
        "西裤男", "男裤", ["衬衫", "男"], ["棉服", "男"], ["棉衣", "男"], ["卫衣", "男"],
    ],
    "女装": [
        "羽绒裤女", "牛仔裤女", "女装", "羽绒服女", "女医生", "女士", "运动裤女",
        "女长裤", "女外套", "棉裤女", ["裤", "女"], ["女", "裤"], "打底裤女", "打底衫女",
        "女短款", "女款", "衬衫女", ["棉服", "女"], ["棉衣", "女"], ["卫衣", "女"],
        "比基尼", "打底衫", "保暖", "半身裙", "连衣裙", "羊毛衫", "坎肩",
    ],
    "鞋包": [
        "棉鞋", "拉杆箱", "雨鞋", "男靴", "旅行包", "单肩包", "帆布鞋", "雨靴", "防水皮箱套",
        "男包", "手提包", "钱包", "拖鞋", "皮鞋", "运动鞋", "休闲包", "胸包", "靴子", "女鞋",
        "女靴", "双肩包", "电暖鞋", "短靴", ["肩", "包"]
    ],
    "珠宝配饰": [
        "腰带", "鞋垫", "皮带", "手套", "围巾", "耳罩", "领带", "项链", "护身符", "表带",
        "耳环", "戒指", "银饰",
    ],
    "户外运动": [
        "健身", "减肥", "塑身", "瘦腰", "瘦腿", "瘦身", "减肚子", "户外", "冲锋裤", "登山裤",
        "瑜伽垫", "运动", "防水", "滑雪", "训练服", "举重", "卧推器", "深蹲架", "杠铃",
        "哑铃", "拐杖", "拐棍", "三脚手杖", "引体向上", "钓鱼铲", "兵工铲", "健身球", "球拍",
        "篮球架", "跳舞", "舞蹈鞋", "轮滑鞋", "跑步", "呼啦圈", "护膝", "冲锋衣"
    ],
    "美妆": [
        "护肤品", "洗面奶", "洁面膏", "牙齿矫正", "遮瑕液", "打底膏", "丰胸", "美胸", "艾叶",
        "艾草", "瘦脸", "脸部按摩", "美容", "遮瑕膏", "眼部按摩", "眼保仪", "吸黑头", "护眼贴",
        "理发", "黑眼圈", "眼膜", "脚底按摩", "卸妆棉", "补水", "卸妆", "精华液", "控油", "补水",
        "矫正器", "按摩器", "刮痧", "刮痧板", "牵引器", "蒸箱", "汗蒸", "体重秤", "矫正带", "BB霜",
        "修容棒", "眼镜", "耳钉", "面膜", "沐浴露", "烫发", "卷发",
    ],
    "女婴": [
        ["儿童", "帽子"], "儿童", "宝宝", "婴儿", "玩具",
    ],
    "食品": [
        "葡萄酒", "零食", "坚果", "苹果", "石斛", "核桃", "枣", "食品", "早餐", "茶", "胶囊", "杂粮",
        "酒", "牛排", "咖啡",
    ],
    "内衣": [
        "内衣"
    ],
    "数码": [
        "键盘", "手机", "电动", "电脑", "安卓", "USB", "钢化膜", "充电宝",
    ],
    "家装": [
        "家装", "玄关",
    ],
    "家居用品": [
        "活性炭", "竹炭", "缝纫机", "家用", "核桃夹", "坚果钳", "清新剂", "洁厕", "蟑螂", "指甲刀",
        "捕鼠", "护发素", "压缩袋", "炒锅", "不粘锅", "秤", "相册", "被子", "尿不湿", "甲醛", "口罩",
        "pm2.5", "衣架", "工具", "浴衣", "墩布", "饭盒", "锅", "碗", "盆", "洗衣", "地垫", "浴室",
        "遮阳伞", "雨伞", "睡衣", "法兰绒", "毛球修剪器", "时钟", "去污", "水杯", "沉香", "香薰", "情趣",
        "卫生巾", "钥匙", "地刮", "灯", "扫把", "簸箕", "干鞋器", "坐垫", "电褥",
    ],
    "汽车": [
        "汽车"
    ],
    "生活服务": [],
    "图书音像": [
        "图书", "中公", "公务员", "习题", "书籍", "记事本",
    ],
    "游戏费用": [
        "游戏"
    ],
    "其它": [],
}
